SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_synth.h
/* Bit fields for SYNTH LPFCTRL1CAL */
#define _SYNTH_LPFCTRL1CAL_RESETVALUE                 0x00000000UL                                 /**< Default value for SYNTH_LPFCTRL1CAL         */
#define _SYNTH_LPFCTRL1CAL_MASK                       0x0003FFFFUL                                 /**< Mask for SYNTH_LPFCTRL1CAL                  */
#define _SYNTH_LPFCTRL1CAL_OP1BWCAL_SHIFT             0                                            /**< Shift value for SYNTH_OP1BWCAL              */
#define _SYNTH_LPFCTRL1CAL_OP1BWCAL_MASK              0xFUL                                        /**< Bit mask for SYNTH_OP1BWCAL                 */
#define _SYNTH_LPFCTRL1CAL_OP1BWCAL_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for SYNTH_LPFCTRL1CAL          */
#define SYNTH_LPFCTRL1CAL_OP1BWCAL_DEFAULT            (_SYNTH_LPFCTRL1CAL_OP1BWCAL_DEFAULT << 0)   /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1CAL  */
#define _SYNTH_LPFCTRL1CAL_OP1COMPCAL_SHIFT           4                                            /**< Shift value for SYNTH_OP1COMPCAL            */
#define _SYNTH_LPFCTRL1CAL_OP1COMPCAL_MASK            0xF0UL                                       /**< Bit mask for SYNTH_OP1COMPCAL               */
#define _SYNTH_LPFCTRL1CAL_OP1COMPCAL_DEFAULT         0x00000000UL                                 /**< Mode DEFAULT for SYNTH_LPFCTRL1CAL          */
#define SYNTH_LPFCTRL1CAL_OP1COMPCAL_DEFAULT          (_SYNTH_LPFCTRL1CAL_OP1COMPCAL_DEFAULT << 4) /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1CAL  */
#define _SYNTH_LPFCTRL1CAL_RFBVALCAL_SHIFT            8                                            /**< Shift value for SYNTH_RFBVALCAL             */
#define _SYNTH_LPFCTRL1CAL_RFBVALCAL_MASK             0x700UL                                      /**< Bit mask for SYNTH_RFBVALCAL                */
#define _SYNTH_LPFCTRL1CAL_RFBVALCAL_DEFAULT          0x00000000UL                                 /**< Mode DEFAULT for SYNTH_LPFCTRL1CAL          */
#define SYNTH_LPFCTRL1CAL_RFBVALCAL_DEFAULT           (_SYNTH_LPFCTRL1CAL_RFBVALCAL_DEFAULT << 8)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1CAL  */
#define _SYNTH_LPFCTRL1CAL_RPVALCAL_SHIFT             11                                           /**< Shift value for SYNTH_RPVALCAL              */
#define _SYNTH_LPFCTRL1CAL_RPVALCAL_MASK              0x3800UL                                     /**< Bit mask for SYNTH_RPVALCAL                 */
#define _SYNTH_LPFCTRL1CAL_RPVALCAL_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for SYNTH_LPFCTRL1CAL          */
#define SYNTH_LPFCTRL1CAL_RPVALCAL_DEFAULT            (_SYNTH_LPFCTRL1CAL_RPVALCAL_DEFAULT << 11)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1CAL  */
#define _SYNTH_LPFCTRL1CAL_RZVALCAL_SHIFT             14                                           /**< Shift value for SYNTH_RZVALCAL              */
#define _SYNTH_LPFCTRL1CAL_RZVALCAL_MASK              0x3C000UL                                    /**< Bit mask for SYNTH_RZVALCAL                 */
#define _SYNTH_LPFCTRL1CAL_RZVALCAL_DEFAULT           0x00000000UL                                 /**< Mode DEFAULT for SYNTH_LPFCTRL1CAL          */
#define SYNTH_LPFCTRL1CAL_RZVALCAL_DEFAULT            (_SYNTH_LPFCTRL1CAL_RZVALCAL_DEFAULT << 14)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1CAL  */

/* Bit fields for SYNTH LPFCTRL1RX */
#define _SYNTH_LPFCTRL1RX_RESETVALUE                  0x00000000UL                               /**< Default value for SYNTH_LPFCTRL1RX          */
#define _SYNTH_LPFCTRL1RX_MASK                        0x0003FFFFUL                               /**< Mask for SYNTH_LPFCTRL1RX                   */
#define _SYNTH_LPFCTRL1RX_OP1BWRX_SHIFT               0                                          /**< Shift value for SYNTH_OP1BWRX               */
#define _SYNTH_LPFCTRL1RX_OP1BWRX_MASK                0xFUL                                      /**< Bit mask for SYNTH_OP1BWRX                  */
#define _SYNTH_LPFCTRL1RX_OP1BWRX_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1RX           */
#define SYNTH_LPFCTRL1RX_OP1BWRX_DEFAULT              (_SYNTH_LPFCTRL1RX_OP1BWRX_DEFAULT << 0)   /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1RX   */
#define _SYNTH_LPFCTRL1RX_OP1COMPRX_SHIFT             4                                          /**< Shift value for SYNTH_OP1COMPRX             */
#define _SYNTH_LPFCTRL1RX_OP1COMPRX_MASK              0xF0UL                                     /**< Bit mask for SYNTH_OP1COMPRX                */
#define _SYNTH_LPFCTRL1RX_OP1COMPRX_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1RX           */
#define SYNTH_LPFCTRL1RX_OP1COMPRX_DEFAULT            (_SYNTH_LPFCTRL1RX_OP1COMPRX_DEFAULT << 4) /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1RX   */
#define _SYNTH_LPFCTRL1RX_RFBVALRX_SHIFT              8                                          /**< Shift value for SYNTH_RFBVALRX              */
#define _SYNTH_LPFCTRL1RX_RFBVALRX_MASK               0x700UL                                    /**< Bit mask for SYNTH_RFBVALRX                 */
#define _SYNTH_LPFCTRL1RX_RFBVALRX_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1RX           */
#define SYNTH_LPFCTRL1RX_RFBVALRX_DEFAULT             (_SYNTH_LPFCTRL1RX_RFBVALRX_DEFAULT << 8)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1RX   */
#define _SYNTH_LPFCTRL1RX_RPVALRX_SHIFT               11                                         /**< Shift value for SYNTH_RPVALRX               */
#define _SYNTH_LPFCTRL1RX_RPVALRX_MASK                0x3800UL                                   /**< Bit mask for SYNTH_RPVALRX                  */
#define _SYNTH_LPFCTRL1RX_RPVALRX_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1RX           */
#define SYNTH_LPFCTRL1RX_RPVALRX_DEFAULT              (_SYNTH_LPFCTRL1RX_RPVALRX_DEFAULT << 11)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1RX   */
#define _SYNTH_LPFCTRL1RX_RZVALRX_SHIFT               14                                         /**< Shift value for SYNTH_RZVALRX               */
#define _SYNTH_LPFCTRL1RX_RZVALRX_MASK                0x3C000UL                                  /**< Bit mask for SYNTH_RZVALRX                  */
#define _SYNTH_LPFCTRL1RX_RZVALRX_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for SYNTH_LPFCTRL1RX           */
#define SYNTH_LPFCTRL1RX_RZVALRX_DEFAULT              (_SYNTH_LPFCTRL1RX_RZVALRX_DEFAULT << 14)  /**< Shifted mode DEFAULT for SYNTH_LPFCTRL1RX   */

